import React, { useEffect, useState } from 'react'
import ControlledCarousel from '../../Components/Caraousel'
import FeedCard from '../../Components/Card/FeedCard'
import axios from 'axios'

const posts = [
  {
    id: 1,
    title: "Өсөн дэвших сэтгэлгээ",
    article: [
      "Зарим хүмүүс бусдаасаа илүү мэдлэг чадвартай, зарим нь үеийнхнээсээ илүү амбицтай, зорилготой, зарим нь төрөлхийн юмыг хурдан сурдаг, тогтоодог авяастай байдаг. Гэвч эдгээр чанарууд нь хүн бүрт тэгш хүртээгүй, адилхан байх албагүй.",
      "Хүнд 2 төрлийн сэтгэлгээ байдаг. Нэг нь тогтмол сэтгэлгээ, нөгөө нь өсөн дэвших сэтгэлгээ юм.",
      "Сэтгэл судлаач Карол Дэвик анх энэхүү дэвшилтэт сэтгэлгээний талаар гаргаж ирсэн бөгөөд энэхүү сэтгэлгээ нь хүний оюуны багтаамж, аливааг харах өнцөг нь өсөж дэвшээд л байх боломжтой байдаг гэж үзсэн. Тогтмол сэтгэлгээг халж өсөн дэвших сэтгэлгээг өөртөө бий болгосоноор хүмүүсийг илүү амжилттай байлгаж болно хэмээн нотолсон байдаг.",
      "Карол Дэвик нь өөрийн багийн гишүүдийн хамт хүмүүсийн сэтгэлгээг сорьсон судалгаанд “Чиний оюун ухаан бол бага, чи ямар нэгэн зүйлийг өөрчлөхөд их юм хийж чадахгүй” гэсэн утга бүхий асуумж тавьжээ. Үүнд: Өсөн дэвших сэтгэлгээтэй хүмүүс нь “Үгүй ээ, тийм биш” гэж хариулж байсан бол тогтмол сэтгэлгээтэй хүмүүс нь “Тиймээ, би муу” гэж хариулсан байна.",
      "Өсөн дэвших сэтгэлгээ нь тогтмол сэтгэлгээнээс ялгаатай. Тогтмол сэтгэлгээ нь ямар нэгэн хандлагад, итгэл үнэмшилд нь хязгаар байдаг буюу өөрөөр хэлбэл оюуны чадамж нь утга учиртайгаар өсөж дэвших боломжгүй сэтгэлгээ юм. Жишээ нь: Болж буй зүйлийг илүү сөргөөр харах, хүлээж авах, бүтэмжгүй хэмээн тооцож сэтгэлээр унах, өөрийгөө буруутгах нь элбэг юм. Харин өсөн дэвших сэтгэлгээтэй хүн өөрийгөө хөгжүүлэх чадвартай, өөртөө тулгарсан төрөл бүрийн бэрхшээл, өөрчлөлтөд бууж өгөхгүй, тэмцдэг. Яагаад гэвэл тэд өөртөө тулгарсан асуудлыг “Энэ бол байдаг л зүйл, энэ бол намайг сорьж байгаа, би илүү сайн байх ёстой” гэж бодож чаддаг. Жишээ нь: Амьдралд тулгарсан, болж өнгөрсөн зүйлээс сайныг нь мөн сургамжтай, эерэг дурсамжуудаа түүж боддог мөн өөртөө талархдаг.Өсөн дэвших сэтгэлгээг хэрхэн бий болгох вэ?",
      "1.Хүн өөрөө нийгмийн амьтан. Нийгмээс суралцаж, өөрийн үнэ цэнийг мэдэрч, туршлагажиж байдаг. Тиймээс их, бага ямар нэгэн бүлэгт хамаарагдаж өөрийн оролцоог нэмэгдүүлэхэд анхаараарай.",
      "2.Аливаа зүйлийг олон өнцгөөс харж сурах чадварт суралцах. Өөрөөр хэлбэл юмсыг олон талаас нь эерэгээр харж, тайлбарлах чадварыг суулгахыг хичээгээрэй.",
      "3.Уран зохиолын ном унших. Энэ нь таныг олон арван мэргэжилтэй, өөр өөр зан араншинтай, байр суурьтай, өөр өөр насны мөн хүйсийн хүмүүстэй уулзуулж, аливааг харах өнцөгт тань нөлөөлөхөд тусална.",
      "4.Хошин шогийн мэдрэмжээ хөгжүүлэх буюу өөрийгөө болон юмсыг хөгжилтэй, шооч, дэмжсэн байдлаар хүлээн авдаг байхыг зориорой.",
    ],
    image: "Picture1.png",
  },
  {
    id: 2,
    title: "Итгэлцэл нь харилцаа холбоог бэхжүүлэгч цавуу юм",
    article: [
      "Хамгийн их итгэдэг, хайрладаг хүндээ хууртагдах нь маш хэцүү мэдрэмжийг төрүүлдэг. Тухайн хууралт нь шударга бус хандах, үнэнч бус байх, ямар нэгэн зүйл нуух гэх мэт ямар ч хэлбэрээр илэрч болох ч эдгээр нь бүгд ёс суртахууны зөрчлийг бий болгож сэтгэл санааг хямраадаг. Хэдий тийм боловч хууралт нь харилцааны төгсгөл биш гэдгийг санаарай.",
      "Хууралт зарим хүмүүст харилцаагаа улам бэхжүүлэхэд тусалдаг бол заримд нь эсрэгээрээ нөлөөлдөг. Гэвч харилцаагаа нэгэнт цааш үргэлжлүүлэхээр шийдсэн үед гомдсон тал нь нөгөө талаа уучилж чадах уу? үгүй юу? гэдэг дээр л төвлөрдөг. Уучлал нь эвлэрэх үйл явцад шаардлагатай боловч харилцаагаа урагшлуулахад төдийлөн хангалтгүй байдаг. Харилцаагаа эргэн сэргээх боломжтой эсэх нь итгэлцлийг эргэн сэргээх эсэхээс хамаарна.",
      "Итгэлцэл нь харилцаа холбоог бэхжүүлэгч цавуу юм. Энэ нь аюулгүй байдлыг мэдрэх боломж олгодог бөгөөд өөр хүмүүстэй сэтгэл хөдлөлийн хувьд холбогдоход хүндрэлтэй болгодог. Харилцаа дөнгөж эхэлж байх үед итгэлцэл нь тухайн хүнээ хүндэлж буй хүндлэлийн хэлбэр болдог ба цаг хугацаа өнгөрөх тусам бие биенээ улам сайн таньж мэдэн итгэлцэл илүү гүн гүнзгий болдог. Гэвч хэн нэгэн нь бидний итгэлийг эвдэх үед бид өөртөө итгэх итгэлээ ч алдаж байдаг.",
      "Бусдын хийсэн зүйлийн талаар эргэцүүлж энэ үйл явдал хэрхэн болсон талаар бодож шаналдаг. Хуурагдсаны дараа харилцаагаа урагшлуулахад бусад хүмүүст итгэх итгэлээ сэргээхээс гадна өөртөө итгэх итгэлээ эргэн сэргээх нь маш чухал.",
      "Итгэлийг дахин бий болгох нь:",
      "1. Өөрийгөө уучлах",
      "Бид нөхцөл байдлыг ойлгох гэж хичээх үедээ өөрийн мэдэлгүй яагаад ийм зүйл болсон талаарх тайлбарыг хайж дараах байдлаар өөрийгөө буруутгах гээд байдаг талтай.",
      "– Хэрвээ би илүү дээр байсан бол ийм зүйл тохиолдохгүй байсан",
      "– Хэрвээ би сэрэмжтэй байсан бол ийм зүйл болж болох талаар урьдчилан мэдэх байсан",
      "Мөн би л дээрдвэл, би л өөрийгөө засаж чадвал дахин ийм зүйл болохгүй гэх мэтээр өөртөө хэт хатуу хандах гээд байдаг. Гэвч алдаа дутагдал гаргасан ч, бүтэлгүйтсэн ч өөрийгөө үнэ цэнэтэйгээр мэдэрч, өөрийгөө хайрлаж, сайн сайхан зүйл хүртэх эрхтэй гэдгээ ойлгож түүнд суралцах нь өөрийгөө уучилж буйн хэлбэр юм. Мөн бусад хүмүүсийн үйлдэл нь зөвхөн тэдний сонголт бөгөөд энэ нь тэднийг хэн болохыг харуулж байгаа болохоос таныг хэн болохыг харуулж буй зүйл биш юм. Тиймээс өөрийгөө хайрлаж, өөрийгөө уучлаарай.",
      "2. Бусдыг уучлах",
    ],
    image: "Picture2.png",
  },
  {
    id: 3,
    title: "Та СТРЕССЭЭ удирдахгүй бол СТРЕСС таныг удирдана",
    article: [
      "'Яаж стрессдэхгүй байх вэ?' гэж хүмүүс их асууж бас эрж хайдаг. Огт стрессдэхгүй байх боломжгүй юм. Та ямар нэг ажил хийж, бие болон оюун санаагаа ядрааж, хүнтэй харилцаж, асуудал шийдэж, өөрийгөө хөгжүүлж байгаа бол стресс танд байнга тохиолдоно. Ямар ч стрессгүй амьдрахыг хүсвэл юу ч хийхгүй, юунд ч санаа зовж, шийдэхийг оролдохгүй, хэнтэй ч харилцахгүй, ууланд бясалгаж суух хэрэгтэй болох байх. Гэхдээ хүн аль болох цөөхөн стрессдэхэд эсвэл стрессдсэн үедээ өөрийгөө тайвшруулахад суралцаж болно. Стресс гэж юу вэ?",
      "ИРЭЭДҮЙД БОЛОХ ГЭЖ БУЙ ЯМАР НЭГ ҮЙЛ ЯВДАЛ ТАНЫ ДААЖ ЧАДАХ АЧААЛЛААС ХЭТЭРСЭН БУЮУ “БИ ҮҮНИЙГ ХИЙЖ ЧАДАХГҮЙ Ш ДЭЭ” ГЭЖ МЭДРЭХ ҮЕД ТАРХИНЫ АЙДСЫН ТӨВ БУЮУ АМИГДАЛА АСЧ СТРЕССИЙН ДААВАР БУЮУ КОРТИЗОЛ ЯЛГАРДАГ. КОРТИЗОЛ ЯЛГАРСНААР ЗҮРХ ХУРДАН ЦОХИЛОХ, ХОДООД АГШИХ, БУЛЧИН ЧАНГАРАХ, АМЬСГАЛ ТҮРГЭСЭХ ЗЭРЭГ БИЕИЙН ХАРИУ УРВАЛ ҮҮСДЭГ. ТЭГЭХЭЭР СТРЕСС ГЭДЭГ НЬ КОРТИЗОЛ ЯЛГАРАХ ҮЕД БИЕИЙН ҮЗҮҮЛЖ БУЙ ХАРИУ УРВАЛ ЮМ. ЭХЭН ҮЕДЭЭ ЭДГЭЭР БИЕИЙН ХАРИУ УРВАЛ НЬ ХҮНД ЭРЧ ХҮЧ ӨГӨХ, АЙЛГААД БАЙГАА АСУУДЛЫГ ШИЙДЭХЭД ТУСЛАХ ЗОРИЛГОТОЙ БОЛ УДААН ХУГАЦААНД АСУУДЛАА ШИЙДЭХГҮЙ ЯВАХ БУЮУ СТРЕССИЙН ДААВАР УДААН ХУГАЦААГААР ЯЛГАРАХ НЬ БИЕД ХОРТОЙГООР НӨЛӨӨЛЖ, ТУСЛАХ БУС ЭСРЭГЭЭРЭЭ ЯДРААЖ, СУЛЬДААЖ ЭХЛЭДЭГ.",
      "Стресс биед хортойгоор нөлөөлж эхлээд буй илтгэх шинжүүд:",
      "•	Нойргүйдэх, амархан сэрэх",
      "•	Анхаарал төвлөрөхгүй байх",
      "•	Булчин чилж өвдөх",
      "•	Гүйлгэх",
      "•	Толгой эргэх",
      "•	Бэлгийн дур хүсэл багасах",
      "•	Хоолны дуршил багасах",
      "•	Байнга ядарсан мэдрэмж төрөх",
      "•	Жижиг зүйлст хэт сүртэй сэтгэл хөдлөл үзүүлэх",
      "•	Шалтгаан тодорхойгүй түгшсэн мэдрэмж төрөх",
      "•	Байнга уурлах",
      "•	Ажлын бүтээмж буурах гэх зэрэг юм.",
      "Стрессийг удирдаж, хортой стрессээс сэргийлэхгүй байснаар дараах эрсдэлтэй:",
      "•	Сэтгэл түгшүүр, улигт бодлын эмгэг, сэтгэл гутрал гэх мэт сэтгэцийн эмгэгүүд үүсэх",
      "•	 Ходоодны шарх үүсэх",
      "•	Зүрх, судасны эмгэг үүсэх",
      "•	Холестролын хэмжээ ихсэх",
      "•	Мэдрэлийн ядаргаа, нойргүйдэх эмгэг үүсэх",
      "•	Анхаарал төвлөрөх болон ой санамжтай холбоотой асуудлууд үүсэх гэх мэт.",
      "Тэгвэл хортой стрессээс сэргийлэхийн тулд:",
      "•	Аль болох үүсээд буй асуудлыг дор дор нь шийдэхийг хичээгээрэй. Асуудлаасаа зугтах тусам таны стрессдэх хугацаа уртасна.",
      "•	Таныг стрессдүүлээд, айлгаад байгаа зүйлийн талаар хэн нэгэнд хэлж мэдрэмжээ гадагшлуулаарай. Энэ нь танд тайвшрахад туслана, мөн асуудлаа шийдэх гарц олоход тусалж болох юм.",
      "•	Ус их ууж, кофе болон чихрийн хэрэглээнээс татгалзаарай. Ус их уух нь кортизол дааврыг биеэс гадагшлуулахад туслана. Харин кофе уух нь нэгэнт түргэн цохилж буй зүрхийг улам түргэсгэх эрсдэлтэй бол чихэр нь кортизолын хэмжээг улам ихэсгэдэг.",
      "•	Дасгал хийж, хөлсөө гаргаж хэвшээрэй. Кортизолыг гадагшлуулах бас нэгэн шалгарсан арга юм. Хүн өглөө сэрэх үед кортизолын хэмжээ хамгийн өндөр байдаг байна. Тиймээс стресстэй эсвэл түгшүүртэй, сэтгэл гутралтай хүмүүст өглөө сэрэх үе хэцүү мэдрэмж өгдөг (жич: сэтгэл гутрал, түгшүүрийн үед ч кортизолын хэмжээ өндөр байдаг). Тэгэхээр өглөөний цагаар дасгал хийх нь илүү үр дүнтэй.",
      "•	Бодлоо засаарай. “Яанаа, ямар аймаар юм бэ, би чадахгүй ш дээ” гэдэг бодлуудаа “ямар гоё юм бэ, хурдан шалгалт болоосой, хурдан хадмуудтайгаа танилцах юмсан” гэх мэт догдолсон бодлоор солиод үзээрэй. Тэгвэл таны биеэс ялгарах даавар ч өөрчлөгдөнө.",
      "•	Бүх зүйлийг хянаж, зөв байлгах гэж хичээх хэрэггүй. Хүний хяналтаас гадуур зүйл гэж байдаг. Жишээ нь: Та хүнийг хүссэнээрээ өөрчлөхөд хэцүү, хүн өөрийгөө л өөрчилдөг. Та байнга гэрээ цэв цэвэрхэн байлгаж чадахгүй, гэр орон чинь музей биш шүү дээ. Таны хайртай хүмүүс нэг л өдөр бурхан болно. Энэ бол байгалийн жам. Хэт бүх зүйлийг хянаж, бүх эрсдлээс сэргийлэх гээд, үүнийг өөрийнхөө үүрэг гэж хүлээгээд авчихсан хүмүүс өндөр стресстэй байдаг.",
      "•	Уужуу амьсгалж, цэвэр агаарт гарч, зөв амьсгалах дасгал хийгээрэй. Стрессийн үед амьсгал замбараагүй болчихсон байдаг. Заримдаа стресстэй хүн амьсгалаа түгжээд, удаан амьсгалахгүй байгаагаа анзаардаггүй. Түгшсэн мэдрэмж төрөх бүрт уртаар амьсгалах дасгал хийвэл бие өөрийгөө тайвшруулж сурна.",
      "•	Булчингаа суллаарай. Иога хийж болно. Стресстэй хүн бүх биеэ чангалаад хумчихсан байдаг. Булчин сулрахад тархинд тайвширлаа, аюул холдлоо гэсэн дохио очдог.",
      "Дээрхийг хэрэгжүүлснээр та олон бие, сэтгэцийн өвчлөлөөс сэргийлж чадна. Өөрөө хэрэгжүүлж үзээд үр дүнгээ найз нөхөд, гэр бүлийнхэндээ хуваалцаж, тэднийг ч мөн стрессээ удирдаж сурахад туслаарай.",
    ],
    image: "Picture3.png",
  },
  {
    id: 4,
    title:
      "Хамгийн ихээр гайхшрал төрүүлсэн 12 сэтгэл зүйн дэмийрэл болон төөрөгдлийн хам шинжүүд",
    article: [
      "Түр зуурын явдлаас хэвийн байдалд шилжих хүртэл, мөн сэтгэцийн хүнд өвчтөнд хүртэл төөрөгдөл нь янз бүрийн байдлаар илэрч болно. Парисын синдром, Отелло синдром гэх мэт …",
      "Энэ бүх дэмийрлийн хам шинж бүрт нэг ижил зүйл бий. Тэр бол бодит байдлаас бий болсон зүйл. Итгэх эсэх нь таны хэрэг ч баримттай мэдээллийг танд хүргэж байна.",
      "1. “Алиса гайхамшгийн оронд” синдром",
      "Зохиолч Льюис Кероллын романы нэрээр нэрлэгдсэн аливаа зүйлийн бодит хэмжээ, орон зай, цаг хугацааг ихэсгэж, багасгаж, томруулж жижгэрүүлж хүртдэг синдром. Зовж шаналж байгаа хүн нь аливаа бодит зүйлийг харахдаа байгаа байдлаас нь хэт жижгээр эсвэл хэт томоор хардаг. Тэд мөн цаг хугацааг ч ойлгоход хүндрэлтэй байж, баримжаагаа алддаг байна.",
      "Энэ нь нийтлэг төөрөгдөл ба оюун ухааны эрүүл байдалтай огт холбоогүй аж. Ийм синдром тусч байсан хүмүүсийн хэлж буйгаар унтахаас нь өмнө эсвэл хүүхэд ахуйд тохиолдох нь элбэг байдаг юм байна.",
      "Энэхүү төөрөгдөл нь толгой таллаж өвдөх өвчнөөс үүдэх нь элбэг бөгөөд Зохиолч Льюис Кэролл ч энэхүү өвчнөөс болж шаналж байсан бөгөөд, энэ нь түүнийг “Алиса гайхамшгийн оронд” зохиолоо бичихэд нь нөлөөлсөн ч байж болох юм.",
      "2. Котардын синдром",
      "Бидний мэдэхээр “Алхаж буй үхдлийн синдром” ч гэж нэрлэгддэг Котардсын синдромтой хүн өөрийгөө огт оршин байдаггүй, эсвэл дотоод эрхтэнгүй болсон гэж боддог.",
      "Котардсын синдромтой хүн бусад хүмүүсээс маш их зайгаа барьдаг бөгөөд өөртөө зохих ёсоор анхаарал тавьж чадахгүй байх хандлагатай байдаг. Ер нь Котардсын синдромоор шаналж буй хүмүүс өөрсдийгөө оршин байгааг үгүйсгэдэг учраас бодит байдлыг ч мөн утгагүй, биегүй гэж үзэх нь мэдээжийн хэрэг юм.",
      "Энэхүү синдром нь шизофрени өвчтэй хүмүүсийн дунд элбэг байдаг.",
      "3. Капграсын төөрөгдөл",
      "Неврологийн шинж тэмдгээрээ Котардсын синдромтой төстэй боловч зарим шинжээрээ ялгаатай. Тухайлбал гэрийнхэн, найз нөхөд гэх мэт ойр дотны хэн нэгнийг гэнэт танихаа больдог бөгөөд хэдхэн мөчийн дараа танихгүй байсан хүн нь хувцсаа сольсон, үсээ янзалсан гэх мэт өмнөхөөсөө арай өөрөөр өөрчлөгдөх хэлбэрээр хүртэгддэг дэмийрэл юм. Капграсын төөрөгдлийг анх судалж тогтоосон Францын мэдрэлийн эмч Жосеф Капграсын нэрээр нэрлэсэн аж.",
      "Капграсыг шизофренитэй хамтатгаж ойлгодог ч энэхүү төөрөгдөл тархины гэмтэл болон тэнэгрэлээс үүсэлтэй аж.",
      "4. Хоёулаа солиоръё",
      "Солиорол хуваалцах буюу “Хоёулаа солиоръё” гэсэн франц үгнээс гаралтай хамгийн онцгой нэршил бүхий синдром. Албан ёсны нэр нь “Солиорох эмгэгийн хуваагдал”. Хоёр болон түүнээс ч олон, ихэвчлэн ойр амьдардаг хүмүүс хамтдаа сөрөг зан үйл бүхий үйлдэл хийдэг байна.",
      "5. Бодолд оруулах эмгэг",
      "Бодолд оруулах эмгэг бол тухайн өвчтөний бодолд бусад хүмүүс нөлөө үзүүлж байгаа юм шиг санагдах байдлаар илэрдэг. Өөрөөр хэлбэл тухайн хүний бодол нь өөрийнх нь бус өрөөлийнх байдаг аж. Ухаан бодол нь сарниж, бусдад шүүмжлэлтэй хандана.",
      "Бодолд оруулах эмгэг нь шизофрени эмгэгийн шинж тэмдэг болдог.",
      "6. Парис синдром",
      "Парис синдром гэдэг нь Парист ирсэн жуулчдад тэрхүү “Гэрэлт хот” төсөөлж байсан хүлээлтэд нийцэхгүй үед тохиолддог. Тэд хавчигдмал байдал, айдас түгшүүр болон бусад биеийн таагүй шинж тэмдгийг мэдэрдэг байна. Парисын синдром нь хошигнол мэт сонсогдож болох ч жил бүр Японоос ирдэг хорин жуулчин тутамд тохиолддог байна. Япончууд Парисын тухай үлгэрийн мэт сайхан төсөөлөлтэй байдаг учир зарим хүмүүс үүнийг соёлын шокноос үүдэлтэй ч гэж үздэг.",
      "Энэхүү синдромыг эмчлэх түгээмэл арга нь зүгээр л эх орон руугаа буцах явдал юм.",
      "7. Иерусалим синдром",
      "Зорьж ирсэн жуулчдад сэтгэл зүйн асуудал үүсгэдэг хот ганцхан Парис биш юм. Иерусалимд ч мөн адил ийм зүйл тохиолддог аж. Иерусалимд ирсэн зарим хүмүүс хотын уур амьсгалд хэт автаж тога өмсөж, библийн ишлэлүүдийг уншин хашхирч, олон нийтийн өмнө номлол үйлдэж эхэлдэг байна. Судлаачдын тооцоолж буйгаар бол энэхүү синдромоор эмнэлэгт хэвтэх хэрэгтэй хүмүүсийн тоо жилд ойролцоогоор 40 байдаг гэсэн таамаглал байдаг.",
      "Парисын синдромын адил гэр лүүгээ буцах нь хамгийн энгийн эмчилгээ юм.",
      "8. Отелло синдром",
      "Отелло синдром бол бидний сайн мэдэх У.Шекспирийн “Отелло” жүжгийн нэрээр нэрлэгдсэн. Хэдий нотлох баримт байхгүй ч гэлээ тухайн өвчтөний хууртагдаж, араар тавиулж байна гэсэн бодол, итгэл үнэмшил нь түүнийг зүгээр ч нэг түгшүүртэй, зовлонт байдалд биш маш хүчтэй зовлонт байдалд хүргэдэг байна. Тэрхүү сэжиглэлт нь тухайн хүнийг байнгын түгшүүртэй, тогтворгүй нөхцөлд оруулдаг сөрөг нөлөөтэй.",
      "Отелло синдромтой хүмүүс байнгын хамтрагчаа мөрдөж, шалгах бөгөөд хаана байгааг нь байцааж, зарим хүнд тохиолдолд хүчирхийлэл хэрэглэх нь ч бий.",
      "9. Экбомын синдром",
      "Экбомын синдром нь хар дарсан зүүдний нэг хэсэг гэж хэлэхэд хилсдэхгүй. Тухайлбал хайпохондрий буюу хүний биед шимэгч хорхой үүрлэсэн байна гэж боддог нь энэхүү синдромын гол онцлог. Ийм хам шинжтэй хүмүүсийн эмгэгийг 1930 онд анх энэ талаар бичиж эхэлсэн Шведийн неврологич Карл Аксел ",
      "Экбомын нэрээр нэрлэсэн. Мөн сюрриализмын нэрт төлөөлөгч Сальвадор Дали ийм өвчинтэй байсан гэж үздэг байна.",
      "10. Клиникийн лайконтропи",
      "Клиникийн лайконтропи бол хүнээс амьтан болж байна гэж итгэх үйл явц юм. Бид бүхний төсөөлөлд ойр байдаг хүнээс чоно болох бус харин мэлхий, зөгий, шувуу, тэр ч байтугай бүр өчүүхэн жижиг шимэгч хүртэл хувирч байна гэж өөрийгөө мэдрэх хам шинж юм.",
      "Энэ нь маш ховор тохиолддог.",
      "11. Дахин хуулбарлагдсан мартах эмгэг",
      "Ихэвчлэн тархины гэмтлээс үүсдэг бөгөөд тухайн хүний байгаа газар, байршил өөр хаа нэгтээ солигдсон, эсвэл хуулбарлагдсан, яагаад ч юм шилжчихсэн байна гэдэгт итгэдэг эмгэг. Толгойдоо гэмтэл авсан цэргүүд хэвтэн эмчлүүлж буй эмнэлэг нь өөрийнх нь амьдардаг хотод байна хэмээн итгэх тохиолдлууд олон бүртгэгдсэн байдаг байна.",
      "Котардсын болон Капграсын хам шинжтэй илрэх шинж тэмдгээрээ адил талтай ч газар нутаг, эд зүйлс шилжсэн байна гэж хүртдэгээрээ ялгаатай.",
      "12. Хос субьектийн синдром",
      "Тухайн өвчтөнд огт өөр танихгүй хүн өөртэй нь ав адилхан харагдах ба зарим тохиолдолд гэр бүлийнхнийхээ хэн нэгнээс, эсвэл гадны хүнээс өөрийнхөө төрхийг олж харж, ижилсүүлэх тохиолдол ч бий. Зарим тохиолдолд өвчтөн өөрийнх нь царай төрхийг хулгайлсан хэмээн андуурч буй хүндээ бие махбод болон сэтгэл санааны хохирол учруулах нь ч бий. Энэхүү хам шинж нь маш ховор байдаг хэдий ч хамгийн түгээмэл байдаг шизофрени өвчтэй хүмүүсийн өвчний хүнд үед ажиглагддаг.",
    ],
    image: "Picture4.png",
  },
]

export default function Feed() {
  const [news, setNews] = useState([])

  useEffect(() => {
    axios.get('/api/get/news').then(res => {
      setNews(res.data)
    })
  }, [])

  return (
    <div className='container'>
        <ControlledCarousel/>
        <div className='row mb-2'>
          {
            news.slice(0, 4).map((data, index) => {
              return(
                <FeedCard post={data} key={index}/>
              )
            })
          }
        </div>
    </div>
  )
}
